 gcc -g p3final.c
 ./a.out
enter the numbers
4
6
46=10
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7fc: file p3final.c, line 16.
(gdb) r
Starting program: /home/runner/pps-test1-madhavis2002-6/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3final.c:16
16  {
(gdb) n
18     input(&x,&y);
(gdb) n
enter the numbers
5
7
19     add(x,y,&sum);
(gdb) p x
$1 = 5
(gdb) p y
$2 = 7
(gdb) p sum
$3 = 32764
(gdb) n
20    output(x,y,sum);
(gdb) n
57=12
21    return 0;
(gdb) n
22  }(gdb) q
A debugging session is active.

    Inferior 1 [process 92] will be killed.

Quit anyway? (y or n) y
 