 gcc -g p5final.c
 ./a.out
enter three numbers
6
7
8
largest of three numbers 6 7 and 8 is 8  
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x841: file p5final.c, line 21.
(gdb) r
Starting program: /home/runner/pps-test1-madhavis2002-6/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p5final.c:21
21  {
(gdb) n
23    input(&a,&b,&c);
(gdb) n
enter three numbers
3
4
5
24    cmp(a,b,c,&large1);
(gdb) n
25    output(a,b,c,large1);
(gdb) p a
$1 = 3
(gdb) p b
$2 = 4
(gdb) p c
$3 = 5
(gdb) p large1
$4 = 5
(gdb) n
26  }
(gdb) q
A debugging session is active.

    Inferior 1 [process 75] will be killed.

Quit anyway? (y or n) y
 